camel-systest/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Action xmlns="http://www.w3.org/2005/08/addressing">
            http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties/GetResourceProperty
        </Action>
        <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:510cf493-2c53-458f-ad7b-780a286cdfae
        </MessageID>
        <To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:9027/myapp/myservice</To>
        <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
            <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
        </ReplyTo>
        <ns2:id xmlns="http://www.w3.org/2005/08/addressing" xmlns:ns2="http://multiplex.transport.cxf.apache.org"
                xmlns:wsa="http://www.w3.org/2005/08/addressing" wsa:IsReferenceParameter="1">counter1
        </ns2:id>
    </soap:Header>
    <soap:Body>
        <ns6:GetResourceProperty
                xmlns:ns2="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.wsdl"
                xmlns:ns3="http://www.w3.org/2005/08/addressing" xmlns:ns4="http://www.w3.org/2006/05/addressing/wsdl"
                xmlns:ns5="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.xsd"
                xmlns:ns6="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.xsd"
                xmlns:ns7="http://www.counter.com">ns7:value
        </ns6:GetResourceProperty>
    </soap:Body>
</soap:Envelope>
