camel-systest/sample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:wsrf="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.wsdl">
    <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>http://counter.com/service/CounterPortType/GetResourcePropertyRequest</wsa:Action>
        <wsa:From>
            <wsa:Address>http://www.example.com/services/someService</wsa:Address>
            <wsa:ReferenceParameters xmlns:counter="http://www.counter.com">
                <counter:id>counter1</counter:id>
            </wsa:ReferenceParameters>
        </wsa:From>
    </soapenv:Header>
    <soapenv:Body>
        <wsrf:GetResourceProperty>{http://www.counter.com}value</wsrf:GetResourceProperty>
    </soapenv:Body>
</soapenv:Envelope>